<template>
  <div class="mt-10 flex flex-col items-center justify-center gap-9 text-black p-8 rounded-lg"
        data-aos="fade-up">
    <h1 class="text-3xl font-bold mb-4">О нас</h1>
    <p>{{ counter }}</p>
    <div class="flex items-center justify-around flex-wrap">
      <div>
        <h2>Приветствуем тебя, дорогой зритель!</h2>
        <p>Добро пожаловать на "Ashanti" - ваш персональный онлайн-кинотеатр, где каждый найдет что-то для себя! Меня зовут КиноГид, и я здесь, чтобы сделать ваше кинематографическое путешествие незабываемым.</p>
      </div>
      <div>
        <h2>Наша Миссия</h2>
        <p>Мы стремимся создать место, где любители кино могут наслаждаться разнообразием фильмов, будь то последние премьеры, классика киноискусства или независимые шедевры. "Ashanti" - это не просто сайт, это кинематографическое сообщество, где каждый может поделиться своим мнением и впечатлениями.</p>
      </div>
      <div>
        <h2>Наша Коллекция</h2>
        <p>У нас вы найдете обширную коллекцию фильмов различных жанров и направлений. Наши кураторы постоянно обновляют ассортимент, чтобы удовлетворить самые изысканные вкусы кинолюбителей. Мы также предлагаем уникальные категории и подборки, чтобы помочь вам найти идеальное кино на любой вкус и настроение.</p>
      </div>
      <div>
        <h2>Новинки и Эксклюзивы</h2>
        <p>"Ashanti" гордится предоставлением доступа к свежим фильмам и эксклюзивным премьерам. Мы уверены, что каждый зритель найдет что-то увлекательное и интересное, следя за нашими регулярными обновлениями.</p>
      </div>
      <div>
        <h2>Персональный Опыт</h2>
        <p>Мы ценим ваше время и комфорт, поэтому создали удобный и интуитивно понятный интерфейс. Функции персонализированных рекомендаций и плейлистов помогут вам легко открывать для себя новые фильмы и возвращаться к любимым шедеврам.</p>
      </div>
      <div>
        <h2>Сообщество КиноЛюбителей</h2>
        <p>"Ashanti" - это не только место для просмотра фильмов, но и площадка для обмена мнениями. Присоединяйтесь к нашему киноклубу, обсуждайте фильмы с другими пользователями, участвуйте в голосованиях и делитесь своими рецензиями.</p>
      </div>
      <div>
        <h2>Приглашаем вас в Ashanti!</h2>
        <p>Спасибо, что выбрали "Ashanti" для вашего кинематографического опыта. Давайте вместе делать</p>
      </div>
    </div>
  </div>
</template>

<script>
// export default {
//   data() {
//     return {
//       counter: 0
//     }
//   },
  
//   created() {
//     setInterval(() => {
//       this.counter++
//     }, 1000)
//   },

//   updated(){
//     if(this.counter === 11) {
//       alert('Поздравляю')
//     }
//   },

// }
</script>
